In [3]:
import pandas as pd

In [4]:
log = pd.read_csv('log.csv', sep=';')

In [5]:
log

                                users              datetime      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [6]:
log.columns = ['user_id','time','bet','win']

In [7]:
log

                              user_id                  time      bet      win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [8]:
def user_number(string): 
    import re 
    string = re.findall(r'user_\d+', string)
    return ''.join(string)
log['user_id'] = log['user_id'].apply(lambda x: user_number(x))

In [9]:
log['time'] = log['time'].apply(lambda x: x if pd.isna(x) else str(x).replace('[',''))

In [10]:
log.time.isna().value_counts()

False    985
True      15
Name: time, dtype: int64

In [11]:
log2 = log.copy()

In [12]:
log2.dropna(axis=1)

      user_id
0    user_919
1    user_973
2    user_903
3    user_954
4    user_954
..        ...
995  user_984
996
997
998
999

[1000 rows x 1 columns]

In [13]:
log2.dropna(axis=0)

      user_id                 time        bet        win
14   user_917   2019-01-02 8:57:36   145732.0  1987653.0
29   user_942  2019-01-04 13:59:42  1678321.0  9876543.0
151  user_982  2019-01-16 21:54:22      100.0     4749.0
189  user_964  2019-01-21 18:34:44      200.0     4667.0
205  user_931   2019-01-22 5:26:59      300.0     4319.0
..        ...                  ...        ...        ...
967  user_975  2019-04-19 22:25:15     1000.0     6108.0
971  user_912  2019-04-20 10:35:49    10554.0    31799.0
972  user_926  2019-04-20 10:35:50    10354.0    30244.0
976  user_970  2019-04-20 10:35:54    10354.0    30691.0
991  user_965  2019-04-20 12:55:41      800.0     6927.0

[133 rows x 4 columns]

In [14]:
log2.user_id.isna().value_counts()

False    1000
Name: user_id, dtype: int64

In [15]:
log2.time.isna().value_counts()

False    985
True      15
Name: time, dtype: int64

In [16]:
log2.drop(columns=['time'])

      user_id      bet      win
0    user_919      NaN      NaN
1    user_973      NaN      NaN
2    user_903      NaN      NaN
3    user_954      NaN      NaN
4    user_954      NaN      NaN
..        ...      ...      ...
995  user_984   9754.0      NaN
996            10054.0  29265.0
997            10454.0      NaN
998             1000.0      NaN
999            10754.0      NaN

[1000 rows x 3 columns]

In [17]:
log2.drop_duplicates(subset=['user_id', 'time'])

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [18]:
log['time']=pd.to_datetime(log['time'])

In [19]:
log['time'].max()

Timestamp('2019-04-20 18:10:07')

In [20]:
## Эта функция аналогична записи 
# year_column = log['time'].apply(lambda x: x.year)

year_column = log['time'].dt.year

### Атрибуты datetime: 
Для начала вспомним, что мы можем делать с datetime. Вот примеры атрибутов, по которым мы можем обращаться к данным объектам:

<li>year: возвращает год</li>
<li>month: возвращает месяц</li>
<li>day: возвращает день</li>
<li>hour, minute, second - час, минута, секунда</li>
<li>dayofweek - день недели, от 0 до 6, где 0 - понедельник, 6 - воскресенье</li>

In [21]:
log['time'].dt.minute.value_counts().head()

36.0    25
31.0    23
6.0     22
50.0    22
14.0    21
Name: time, dtype: int64

In [22]:
log['time'].dt.month.value_counts()

1.0    292
3.0    264
2.0    259
4.0    170
Name: time, dtype: int64

In [23]:
log[(log['time'].dt.dayofweek==6) | (log['time'].dt.dayofweek==5)].count()

user_id    283
time       283
bet        127
win         37
dtype: int64

In [24]:
log['time'].dt.dayofweek

0      1.0
1      1.0
2      1.0
3      1.0
4      1.0
      ...
995    5.0
996    NaN
997    NaN
998    NaN
999    NaN
Name: time, Length: 1000, dtype: float64

In [25]:
log.time.dropna()
log['timeday']=0
def daytime(column, data=log):
    for i in range(len(data[column])): 
        hour=data[column][i].hour
        if hour>=0 and hour<6:
            data['timeday'][i]='ночь'
        elif hour>=6 and hour<12: 
            data['timeday'][i]='утро'
        elif hour>=12 and hour<18:
            data['timeday'][i]='день'
        elif hour>=18 and hour<24:
            data['timeday'][i]='вечер'
    return data.head(30)

In [26]:
daytime('time')

<ipython-input-25-d1d9c108ad4c>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['timeday'][i]='день'
/opt/homebrew/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)
<ipython-input-25-d1d9c108ad4c>:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['timeday'][i]='вечер'
<ipython-input-25-d1d9c108ad4c>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['timeday'][i]='ночь'
<ipython-input-25-d1d9c108ad4c>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['timeday'][i]='утро'

     user_id                time        bet        win timeday
0   user_919 2019-01-01 14:06:51        NaN        NaN    день
1   user_973 2019-01-01 14:51:16        NaN        NaN    день
2   user_903 2019-01-01 16:31:16        NaN        NaN    день
3   user_954 2019-01-01 17:17:51        NaN        NaN    день
4   user_954 2019-01-01 21:31:18        NaN        NaN   вечер
5   user_917 2019-01-01 23:34:55   156789.0        NaN   вечер
6   user_900 2019-01-01 04:37:25        NaN        NaN    ночь
7   user_980 2019-01-01 06:31:23        NaN        NaN    утро
8   user_906 2019-01-02 10:57:08        NaN        NaN    утро
9   user_952 2019-01-02 16:55:06        NaN        NaN    день
10  user_972 2019-01-02 20:47:54        NaN        NaN   вечер
11  user_966 2019-01-02 21:32:20        NaN        NaN   вечер
12  user_964 2019-01-02 21:32:35        NaN        NaN   вечер
13  user_978 2019-01-02 05:25:40        NaN        NaN    ночь
14  user_917 2019-01-02 08:57:36   145732.0  1987653.0    утро
15  user_968 2019-01-02 09:32:24        NaN        NaN    утро
16  user_974 2019-01-03 10:43:41        NaN        NaN    утро
17  user_998 2019-01-03 11:29:08        NaN        NaN    утро
18  user_990 2019-01-03 13:12:46        NaN        NaN    день
19  user_942 2019-01-03 14:03:21    98753.0        NaN    день
20  user_929 2019-01-03 17:20:23        NaN        NaN    день
21  user_976 2019-01-03 18:24:25        NaN        NaN   вечер
22  user_927 2019-01-03 18:45:54        NaN        NaN   вечер
23  user_998 2019-01-03 02:48:25        NaN        NaN    ночь
24  user_951 2019-01-03 05:30:43        NaN        NaN    ночь
25  user_949 2019-01-03 05:49:42        NaN        NaN    ночь
26  user_976 2019-01-04 01:59:34        NaN        NaN    ночь
27  user_987 2019-01-04 11:50:21        NaN        NaN    утро
28  user_976 2019-01-04 12:49:31        NaN        NaN    день
29  user_942 2019-01-04 13:59:42  1678321.0  9876543.0    день

In [27]:
log.timeday.value_counts()

ночь     265
утро     253
день     240
вечер    227
0         15
Name: timeday, dtype: int64

In [28]:
log = pd.read_csv('log.csv', sep=';')

In [29]:
log.columns=['user_id', 'time', 'bet', 'win']

In [30]:
log=log.dropna()

In [31]:
log['time']=log['time'].apply(lambda x: str(x).replace('[',''))

In [32]:
log

,user_id,time,bet,win
14,Запись пользователя № - user_917,2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0

In [33]:
log['time']=pd.to_datetime(log['time'])

In [34]:
log['hour']=log['time'].dt.hour

In [35]:
log

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

In [36]:
import pandas as pd
log = pd.read_csv('log.csv', sep=';')
log.columns=['user_id', 'time', 'bet', 'win']
log=log.dropna()
log['time']=log['time'].apply(lambda x: str(x).replace('[',''))
log['time']=pd.to_datetime(log['time'])
log['hour']=log['time'].dt.hour

In [37]:
log

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

## Python 12.5

In [38]:
log=pd.read_csv('log.csv',sep=';', header=None)

In [39]:
log.columns=['user_id', 'time', 'bet', 'win']

In [40]:
log['bet']=log['bet'].fillna(0)

In [41]:
log['bet'].value_counts()

0          515
500         50
100         48
300         42
800         42
200         40
400         40
700         38
600         37
1000        37
900         30
10554       10
9754        10
10154        7
10254        7
9954         6
10454        6
10654        5
10754        5
10054        4
10354        4
9854         2
123981       1
1678321      1
8700         1
bet          1
145732       1
7650         1
9876         1
27000        1
156789       1
950          1
5000         1
12945        1
104540       1
12548        1
98753        1
8734         1
Name: bet, dtype: int64

In [47]:
def fillna_win(row):
    if row.notnull()==True:
        return row

In [54]:
fillna_win(log['win'][1])

AttributeError: 'float' object has no attribute 'notnull'

In [53]:
log['win'][2]

nan